In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('City_Zri_AllHomesPlusMultifamily.csv', encoding="ISO-8859-1")

In [3]:
df.sample(5)

,RegionID,RegionName,State,Metro,CountyName,SizeRank,2010-11,2010-12,2011-01,2011-02,...,2018-04,2018-05,2018-06,2018-07,2018-08,2018-09,2018-10,2018-11,2018-12,2019-01
2937,10197,Aston,PA,Philadelphia-Camden-Wilmington,Delaware County,2938,1465.0,1478.0,1491.0,1507.0,...,1732,1740,1740,1740,1740,1740,1742,1737,1726,1711
10491,31349,Eaton,CO,Greeley,Weld County,10492,NaN,NaN,NaN,NaN,...,1680,1704,1719,1732,1738,1740,1740,1737,1733,1729
783,17310,Carmichael,CA,Sacramento--Roseville--Arden-Arcade,Sacramento County,784,1475.0,1468.0,1454.0,1459.0,...,1830,1825,1821,1818,1818,1820,1827,1843,1863,1882
492,37736,Canton,GA,Atlanta-Sandy Springs-Roswell,Cherokee County,493,1298.0,1297.0,1299.0,1303.0,...,1541,1538,1537,1537,1537,1537,1543,1562,1582,1598
1651,4560,Ellensburg,WA,Ellensburg,Kittitas County,1652,1282.0,1276.0,1275.0,1274.0,...,1520,1540,1556,1567,1570,1569,1571,1582,1591,1592

In [4]:
df_Hoboken = df[df['RegionName'] == 'Hoboken']

In [5]:
df_Hoboken = df_Hoboken.iloc[:, 6:]

In [6]:
df_Hoboken = df_Hoboken.T

In [7]:
df_Hoboken = df_Hoboken.reset_index()

In [8]:
df_Hoboken = df_Hoboken.rename(columns={'index':'date', 903:'price'})

In [9]:
df_Hoboken['date'] = pd.to_datetime(df_Hoboken['date'], format='%Y-%m')

In [10]:
df_Hoboken.head()

        date   price
0 2010-11-01  2534.0
1 2010-12-01  2553.0
2 2011-01-01  2553.0
3 2011-02-01  2539.0
4 2011-03-01  2525.0

In [11]:
df_UnionCity = df[(df['RegionName'] == 'Union City') & (df['State'] == 'NJ')]

In [12]:
df_UnionCity = df_UnionCity.iloc[:, 6:]

In [13]:
df_UnionCity = df_UnionCity.T

In [14]:
df_UnionCity = df_UnionCity.reset_index()

In [15]:
df_UnionCity = df_UnionCity.rename(columns={'index':'date', 650:'price'})

In [16]:
df_UnionCity['date'] = pd.to_datetime(df_UnionCity['date'], format='%Y-%m')

In [17]:
df_UnionCity.head()

        date   price
0 2010-11-01  1864.0
1 2010-12-01  1841.0
2 2011-01-01  1830.0
3 2011-02-01  1827.0
4 2011-03-01  1828.0

In [18]:
df_JerseyCity = df[df['RegionName'] == 'Jersey City']

In [19]:
df_JerseyCity = df_JerseyCity.iloc[:, 6:]

In [20]:
df_JerseyCity = df_JerseyCity.T

In [21]:
df_JerseyCity = df_JerseyCity.reset_index()

In [22]:
df_JerseyCity = df_JerseyCity.rename(columns={'index':'date', 75:'price'})

In [23]:
df_JerseyCity['date'] = pd.to_datetime(df_JerseyCity['date'], format='%Y-%m')

In [24]:
df_JerseyCity.head()

        date   price
0 2010-11-01  1787.0
1 2010-12-01  1812.0
2 2011-01-01  1822.0
3 2011-02-01  1827.0
4 2011-03-01  1846.0

In [25]:
df_Hoboken.to_csv('Hoboken_price.csv', index=False)

In [26]:
df_UnionCity.to_csv('UnionCity_price.csv', index=False)

In [27]:
df_JerseyCity.to_csv('JerseyCity_price.csv', index=False)